# YOLOv5 🚀 by Ultralytics, GPL-3.0 license

# Parameters
nc: 80  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.50  # layer channel multiple
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]              [1*3*640*640]
  [[-1, 1, Conv, [64, 6, 2, 2]],  # 0-P1/2 [b, 64, 320, 320]
   [-1, 1, AKConv, [128, 3, 2]],  # 1-P2/4 [b, 128, 160, 160]
   [-1, 3, C3, [128]],
   [-1, 1, AKConv, [256, 3, 2]],  # 3-P3/8 [b, 256, 80, 80]
   [-1, 6, C3, [256]],          #4       [1*128*80*80]
   [-1, 1, Conv, [512, 3, 2]],  # 5-P4/16[1*256*40*40]
   [-1, 9, C3, [512]],          #6       [1*256*40*40]
   [-1, 1, Conv, [1024, 3, 2]],  # 7-P5/32[1*512*20*20]
   [-1, 3, C3, [1024]],#         8       [1*512*20*20]
   [-1, 1, SPPF, [1024, 5]],  # 9        [1*512*20*20]->[1*256*20*20]->[1*1024*20*20]->[1*512*20*20]
  ]

# YOLOv5 v6.0 head
head:
  [[-1, 1, Conv, [512, 1, 1]],                #10[1*256*20*20]
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],#11[1*256*40*40]
   [[-1, 6], 1, Concat, [1]],  # cat backbone P4   #12[1*512*40*40]
   [-1, 3, C3, [512, False]],  # 13                [1*256*40*40]

   [-1, 1, Conv, [256, 1, 1]],# 14                  [ 1*128*40*40]
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],      #15[1*128*80*80]
   [[-1, 4], 1, Concat, [1]],  # cat backbone P3   #16[1*256*80*80]
   [-1, 3, C3, [256, False]],  # 17 (P3/8-small)       [1*128*80*80]

   [-1, 1, Conv, [256, 3, 2]],  # 18                [1*128*40*40]
   [[-1, 14], 1, Concat, [1]],  # 19 cat head P4     [1*256*40*40]
   [-1, 3, C3, [512, False]],  # 20 (P4/16-medium)    [1*256*40*40]

   [-1, 1, Conv, [512, 3, 2]],  # 21                [1*256*20*20]
   [[-1, 10], 1, Concat, [1]],  #22 cat head P5     [1*512*20*20]?
   [-1, 3, C3, [1024, False]],  # 23 (P5/32-large)   [1*512*20*20]

   [[17, 20, 23], 1, ASFF_Detect, [nc, anchors]],  # Detect(P3, P4, P5)    #[1*128*80*80],[1*256*40*40],[1*512*20*20]
  ]
